# from .models import *
# from automation.models import *

WEEKDAY_CHOICES = [
        (2, 'دوشنبه'),
        (3, 'سه شنبه'),
        (4, 'چهارشنبه'),
        (5, 'پنج شنبه'),
        (6, 'جمعه'),
        (0, 'شنبه'),
        (1, 'یکشنبه'),
    ]

WEATHER_CHOICES = [
        (0, "تعیین نشده"),
        (1, "آفتابی"),
        (2, "ابری"),
        (3, "بارانی"),
        (4, "برفی"),
]

MACHINE_TYPES = [
        # (0, "نامشخص"),
        (1, "سواری"),
        (2, "وانت"),
        (3, "تراک"),
        (4, "ابزار"),
]


MACHINE_OWNERSHIPS = [
        # (0, "نامشخص"),
        (1, "شرکتی"),
        (2, "استیجاری"),
]


CONTRACT_TYPES = [
        # (0, "نامشخص"),
        (1, "فهرستی"),
        (2, "لام سام"),
        (3, "فهرست خاص"),
]
